{"status":"ok","feed":{"url":"https://www.reddit.com/r/entrepreneur/top.xml?limit=all","title":"top scoring links : Entrepreneur","link":"https://www.reddit.com/r/entrepreneur/top?limit=all","author":"","description":"A community of individuals who seek to solve problems, network professionally, collaborate on projects and make the world a better place. Be professional, humble, and open to new ideas.","image":"https://b.thumbs.redditmedia.com/hTQR94j8E_uayzkgvnjrBo5YOCrYp8JVM8IhdCmlcjo.png"},"items":[{"title":"Yelp now displays upwards of 10 to 13 advertisements above the first organic result.","pubDate":"2019-06-18 23:03:21","link":"https://www.reddit.com/r/Entrepreneur/comments/c298xm/yelp_now_displays_upwards_of_10_to_13/","guid":"t3_c298xm","author":"/u/professordurian","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Clearly they are desperate for revenue. I don't think I have ever seen anything compromise the integrity of a site or platform as much as this change.</p> <p>​</p> <p>Worst part is, they have designed it in a way that makes the average user not realize they are seeing an AD.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/professordurian\"> /u/professordurian </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c298xm/yelp_now_displays_upwards_of_10_to_13/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c298xm/yelp_now_displays_upwards_of_10_to_13/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Clearly they are desperate for revenue. I don't think I have ever seen anything compromise the integrity of a site or platform as much as this change.</p> <p>​</p> <p>Worst part is, they have designed it in a way that makes the average user not realize they are seeing an AD.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/professordurian\"> /u/professordurian </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c298xm/yelp_now_displays_upwards_of_10_to_13/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c298xm/yelp_now_displays_upwards_of_10_to_13/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"We sold Bitcoins at our condo and people queued an hour for it","pubDate":"2019-06-19 02:57:57","link":"https://www.reddit.com/r/Entrepreneur/comments/c2bnq1/we_sold_bitcoins_at_our_condo_and_people_queued/","guid":"t3_c2bnq1","author":"/u/nubela","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>This is a story of a stupid idea.</p> <p>In 2017, my company downsized to just Bach and me after shutting down Kloudsec and we were building SilvrBullet. Because it was only the two of us, we rented a lovely studio condo apartment 5 minutes away from my home. All we needed was a table, internet, and our laptops to build The Next Big Thing (TM).</p> <p>At this point, we have dedicated close to a year's worth of development time working on a product that was not making money. Then, Bitcoin was about $1200, and I had discovered Monero. We would spend our lunch everyday talking about it.</p> <p>Both Bach and I knew about Bitcoin when it was worth close to nothing, and simply to say, we missed the boat a couple of times, and I was sore. I have personally dismissed it to a pyramid scheme with cool technology. But Monero was different, and it is everything that Bitcoin should be -- private, fungible, and best of all, CHEAP! It was $8 when I discovered it.</p> <p>I remember spending about 1-month researching and ruminating on whether I should buy it or not, and then I decided to pull the trigger.</p> <p>Fuck, where do I start? I went to Coinhako, sent my funds over, performed my verification, set up my wallet, made a buy order, did a transfer, ensuring that every character was correct. Even as a programmer, this was hard!</p> <p>If I found it hard to buy Bitcoin (I had to buy Bitcoin to swap into Monero), then how can the average person do it?</p> <p>So I asked Bach what if we offered a Bitcoin shop? A shop by which anyone can walk in, pony up the cash and professional staff who knows what they are doing will set you up. I remember laughing as we were walking back from lunch as the idea of two programmers opening a retail shop selling Bitcoin was so ridiculous. But we did it anyway because why I cannot think of a reason why I should not. So we did it, but instead of retail space, we used the condo instead.</p> <p>Many months later, during the cryptocurrency boom as Bitcoin went all the way up to US$20000, we had daily long queues snaking outside our condo. We increased our staff to 5 people. Bach, the programmer, will pick up the phone. Another will be downstairs opening the gate for the next guest, and another will be in the condo serving the customer. And this is the story of how NuMoney got started.</p> <p>Don't dismiss stupid ideas. Try it first and let the market tell you it is ridiculous, or not.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/nubela\"> /u/nubela </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2bnq1/we_sold_bitcoins_at_our_condo_and_people_queued/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2bnq1/we_sold_bitcoins_at_our_condo_and_people_queued/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>This is a story of a stupid idea.</p> <p>In 2017, my company downsized to just Bach and me after shutting down Kloudsec and we were building SilvrBullet. Because it was only the two of us, we rented a lovely studio condo apartment 5 minutes away from my home. All we needed was a table, internet, and our laptops to build The Next Big Thing (TM).</p> <p>At this point, we have dedicated close to a year's worth of development time working on a product that was not making money. Then, Bitcoin was about $1200, and I had discovered Monero. We would spend our lunch everyday talking about it.</p> <p>Both Bach and I knew about Bitcoin when it was worth close to nothing, and simply to say, we missed the boat a couple of times, and I was sore. I have personally dismissed it to a pyramid scheme with cool technology. But Monero was different, and it is everything that Bitcoin should be -- private, fungible, and best of all, CHEAP! It was $8 when I discovered it.</p> <p>I remember spending about 1-month researching and ruminating on whether I should buy it or not, and then I decided to pull the trigger.</p> <p>Fuck, where do I start? I went to Coinhako, sent my funds over, performed my verification, set up my wallet, made a buy order, did a transfer, ensuring that every character was correct. Even as a programmer, this was hard!</p> <p>If I found it hard to buy Bitcoin (I had to buy Bitcoin to swap into Monero), then how can the average person do it?</p> <p>So I asked Bach what if we offered a Bitcoin shop? A shop by which anyone can walk in, pony up the cash and professional staff who knows what they are doing will set you up. I remember laughing as we were walking back from lunch as the idea of two programmers opening a retail shop selling Bitcoin was so ridiculous. But we did it anyway because why I cannot think of a reason why I should not. So we did it, but instead of retail space, we used the condo instead.</p> <p>Many months later, during the cryptocurrency boom as Bitcoin went all the way up to US$20000, we had daily long queues snaking outside our condo. We increased our staff to 5 people. Bach, the programmer, will pick up the phone. Another will be downstairs opening the gate for the next guest, and another will be in the condo serving the customer. And this is the story of how NuMoney got started.</p> <p>Don't dismiss stupid ideas. Try it first and let the market tell you it is ridiculous, or not.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/nubela\"> /u/nubela </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2bnq1/we_sold_bitcoins_at_our_condo_and_people_queued/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2bnq1/we_sold_bitcoins_at_our_condo_and_people_queued/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"Feeling overwhelmed af ...","pubDate":"2019-06-19 16:49:16","link":"https://www.reddit.com/r/Entrepreneur/comments/c2jg35/feeling_overwhelmed_af/","guid":"t3_c2jg35","author":"/u/LifeIsReallyHard55","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I’m an 18 year old guy with big dreams of running my own successful business. I’ve been feeling quite overwhelmed recently and I’m not really sure what to do. I’m currently a college student at UC Berkeley. Right now, I really want to start a business, but at the same time I’m in college which is super time consuming. Also, there are just a ton of different things I want to try. I don’t have any true skills yet, and I want to build some in order to help me create a business. I just have so many options for things I can do. I could learn to code, market products, do research, or basically anything else. I feel like I have too many choices. For anyone else who has ever felt like this, how did you get through it? How did you sort through all of the options you have and find the thing you really enjoy and turn that into a business? How do you balance your time with all the things you are interested and all the new things you want to learn? </p> <p>TLDR: I know this rant doesn’t make that much sense so I’ll summarize it. There are so many things I want to try that I feel overwhelmed and don’t know what to do.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/LifeIsReallyHard55\"> /u/LifeIsReallyHard55 </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2jg35/feeling_overwhelmed_af/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2jg35/feeling_overwhelmed_af/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I’m an 18 year old guy with big dreams of running my own successful business. I’ve been feeling quite overwhelmed recently and I’m not really sure what to do. I’m currently a college student at UC Berkeley. Right now, I really want to start a business, but at the same time I’m in college which is super time consuming. Also, there are just a ton of different things I want to try. I don’t have any true skills yet, and I want to build some in order to help me create a business. I just have so many options for things I can do. I could learn to code, market products, do research, or basically anything else. I feel like I have too many choices. For anyone else who has ever felt like this, how did you get through it? How did you sort through all of the options you have and find the thing you really enjoy and turn that into a business? How do you balance your time with all the things you are interested and all the new things you want to learn? </p> <p>TLDR: I know this rant doesn’t make that much sense so I’ll summarize it. There are so many things I want to try that I feel overwhelmed and don’t know what to do.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/LifeIsReallyHard55\"> /u/LifeIsReallyHard55 </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2jg35/feeling_overwhelmed_af/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2jg35/feeling_overwhelmed_af/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"$60k/mo selling male rompers.","pubDate":"2019-06-19 16:15:02","link":"https://www.reddit.com/r/Entrepreneur/comments/c2j10c/60kmo_selling_male_rompers/","guid":"t3_c2j10c","author":"/u/youngrichntasteless","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Hey - Pat from <a href=\"https://www.starterstory.com/\">StarterStory.com</a> here with another interview.</p> <p>Today's interview is with Justin Clark of <a href=\"https://www.romperjack.com/\">RomperJack</a>, a brand that sells men's rompers and jumpsuits.</p> <p><strong>Some stats:</strong></p> <ul>\n<li>Product: Men's rompers and jumpsuits.</li> <li>Revenue/mo: $60,000</li> <li>Started: July 2017</li> <li>Location: Los Angeles</li> <li>Founders: 3</li> <li>Employees: 1</li> </ul>\n<h3>Hello! Who are you and what business did you start?</h3> <p>Hello, my name is Justin Clark, I’m 31 and I am the founder of <a href=\"https://romperjack.com/\">RomperJack</a>. RomperJack is a men’s apparel company that specifically sells men's rompers and jumpsuits. Our rompers are made from premium materials and designed to be perfectly fitted.</p> <p>RomperJack is a premium men’s brand that is predominately preferred by the LGBTQ community. Our customers tend to be bold, confident and unique. Our customers enjoy our floral patterns, tight fit, and whacky styling.</p> <p>Men's rompers are very unique and have not even been around for 2 years yet.</p> <p>For those who are unfamiliar with a mens romper; it’s a button up shirt sewn into shorts and a jumpsuit is a button up shirt sewn into pants, like a fashionable onesie. Check out the pictures below….</p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/708/original/open-uri20190526-4-m7fhpd?1558887068\">image</a></p> <p><em>Romper/Jumpsuit….</em></p> <h3>What's your backstory and how did you come up with the idea?</h3> <p>Actually, it’s kind of a cool backstory... </p> <p>In late 2015, I was just about to go to Medical School and shortly before, I came up with an app idea called <a href=\"http://www.whiztutorapp.com/\">Whiz Tutor</a>. Whiz Tutor is similar to Uber however, is designed to help parents and students find local, on-demand tutors in their area. </p> <p>Long story short, I raised capital, launched the platform, went through an accelerator program, raised more capital, and began to scale. I ended up choosing to remain in the entrepreneur world and haven’t looked back. This early startup ultimately gave me the skills and provided me with the team that would later open the door to RomperJack. Whiz Tutor to this date is still our main focus and is continuing to prosper and grow everyday.</p> <p>As Whiz Tutor was growing and becoming more and more popular, we never really thought about how slow it would be during the summertime as an Ed-tech startup. Well, let’s just say you can hear crickets in our office during summertime because Tutoring is not cool and hip especially when school is on break. Summer time is Whiz Tutor’s slow period so this gives us time to play around with other possible business opportunities.</p> <p>In May 2017 just after finals ended (Just after our busiest time for whiz tutor), I came across a Kickstarter campaign called <a href=\"https://www.kickstarter.com/projects/106904571/the-romphimtm-your-new-favorite-summer-outfit\">Romphim</a>; it was a couple of guys trying to launch the men's romper. They essentially wanted to raise $10,000 to get their project going, but by day 3 they already raised $330,000! I was blown away!! The first thing that popped in my head was product-market fit. They had this instant explosive traction and they didn’t have a single competitor. </p> <p>So I gave them a competitor, MEEEE 😎. I remember that day calling a couple of friends and quickly asking them for some funding that would be used to help design the rompers and buy inventory. After about a minute of me pitching them, they all happily agreed. Also, My other Whiz Tutor Co-founders all agreed to help as well. </p> <p>That was the day the idea was born. </p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/709/original/open-uri20190526-4-ds9rml?1558887068\">image</a></p> <h3>Take us through the process of designing, prototyping, and manufacturing your first product.</h3> <p>When we first saw the romper on Kickstarter, all we had to work with was a picture since no one was actually selling mens rompers at the time. </p> <p>So we took that picture, threw it into Photoshop, changed the color and gave the romper a more tapered and fitted look. We changed the fit and look of the romper because we were targeting the LGBTQ audience. This specific customers tends to like clothing more fitted. Once we were happy with the look that's when I reached out to different manufacturers on Alibaba.</p> <p>Before Romperjack, I did have some experience sourcing products on Alibaba. I’ve sourced many samples for other side projects that never really got going but that experience gave me a pretty good upper-hand. </p> <p>Usually, when you source products, you reach out to multiple manufacturers for samples, but since no one has ever made this product, we had to do this differently. I vividly remember this clothing manufacturer that I stumbled upon who was making women's’ rompers oversees. </p> <p>I decided to email them a picture of the romper and asked if they could make it. A man named Baloo (yes like The Jungle Book) responded to the email and started asking me all sorts of fashion/garment manufacturing questions. I had no idea what he was talking about. I knew absolutely nothing about fashion so I was completely lost. </p> <p>So, I just told him “Baloo I don’t know a single thing about fashion but I need to get a sample made, can you take this picture and pretend you were going to make a men’s romper sample for a 180lb, 6-foot man.” </p> <p>He emailed back and said “My friend, no problem. I make for you!” Two weeks later I had a sample. 😂</p> <p>The first sample we got was really, really bad. The material was really thin, the fit was way off and it felt cheaply made. However, we at least had something to work with. We measured the sample and then went shopping for better materials.</p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/710/original/open-uri20190526-4-7sw691?1558887069\">image</a></p> <p><em>The picture above is of my brother wearing the first sample. This was actually the first picture taken of the product.</em></p> <p>I sent Baloo the material we were looking for and the new measurements. Within two weeks, we got the new samples and they were perfect! Baloo and I discussed MOQ (Minimum order quantity) pricing and once I was satisfied, I made a bulk order for 1 style with 4 different colors.</p> <p>The first order we purchased was for 1200 pieces 4 different styles.</p> <h3>Describe the process of launching the business.</h3> <p>At the time, none of us had any experience with fashion nor an inventory-related business, so we were like a chicken blindfolded running around when we launched. </p> <p>The first issue we had when creating our website was that we had no available product to take pictures of so we had to use our photoshop mock-ups to create the original site. The second issue was that we had no clear understanding of who our market was. No one had ever tried to sell a male romper before, so we had no idea who to even market to. </p> <p>Even though we had some things against us we did know how to create a business, market/advertise and how to create a well-designed website. For the website, we decided to use Shopify to power our e-commerce store and host our site. Shopify definitely has the best platform for merchants. To file our business LLC and to create a DBA, we used <a href=\"https://www.legalzoom.com/country/us\">LEGALZOOM</a>.</p> <p>We also filed for a trademark to protect the RomperJack name, to do this we used <a href=\"https://www.trademarkia.com/\">Trademarkia</a>. To source the product and find credible manufacturers we used Alibaba.</p> <p>Once we finally finished building the site, we needed to run a live test to make sure everything was functioning correctly.. (keep in mind we had no product at this time, I believe the product was not supposed to arrive for about 35 more days). I published the website to test everything and 30 seconds after doing so, someone in San Francisco somehow found our brand new romper site and purchased a romper. NO JOKE!!! 30 seconds after launch, someone bought!!! We all freaked out, we didn’t even have anything to send him, lol. Long story short we had to email the customer to let him know what had happened and we promised him a free romper once we got our stock.</p> <p>The customer that bought the first romper gave us the idea to sell on pre-order because we knew that customers would still purchase pre-orders if no one else was selling rompers yet. So we officially launched the store on July 10, 2017 and on the first day, I remember we did about $1200 in sales. We were so stoked and have only continued to grow since then.</p> <h3>Since launch, what has worked to attract and retain customers?</h3> <p>Before Romperjack came to life, we were already running 2 online companies making us already extremely familiar with different online marketing tactics. However, we weren’t sure which ones would necessarily work better - which is where testing came in to play. </p> <p>When we first launched Romperjack, we had a huge advantage right off the bat which was having very very strong SEO, like page 1 spot #2 for our keywords. This was simply due to the fact that there were only 2 companies in the world at the time selling mens rompers - Us (Romperjack) and Romphim. Since this day, we have remained in the #2 spot.</p> <p>To build our initial traffic and to find an audience, we tested and utilized a ton of different marketing platforms… Facebook/Instagram, Snapchat, Pinterest, Ad roll (retargeting), Google Ad Words, Bing Ad Words, Reddit Ads, Outbrain, Influencer Marketing etc… Now, not all these platforms worked. In fact, some of them failed miserably.</p> <p>Over the past 2 years, we have simplified our marketing down to 4 keys things: I will break them down:</p> <p><strong>Facebook and Instagram Ads</strong></p> <p>We use this platform to find new customers and to retarget current interested customers. Facebook ROAS is about 4.2X. </p> <p>In the beginning we casted a very wide net to find our target audience and as we got more and more sales we narrowed that audience down. Now we run lookalike campaigns based off our customer list. </p> <p>We also have a sales funnel setup to capture a customer at multiple stages. We run a ton of retargeting campaigns at different stages to finalize the sale.</p> <p><strong>Google AdWords</strong></p> <p>We use this platform for the mid-level funnel. People who find us through Google Ad Words by searching our key words means that they are seriously thinking about buying. We buy keywords like mens romper or male romper so when one puts that into google we pop up.</p> <p><strong>AdRoll</strong></p> <p>This does retargeting that is seen on 1000’s of websites. Retargeting is a way to show ads to customers that visited your site but did not purchase. It’s kind of like subliminal marketing, they see the ad and it reminds them, then later on they come to back to purchase. We have about a 12X ROAS with retargeting. This is super simple to setup, Adroll will even make the ad for you.</p> <p>The last thing we use is email marketing. We build email lists of interested customers by offering them something when they subscribe. These lists build over time and with the right campaign we can get these customers to convert quite well.</p> <p>All in all, Romperjack has about 45k visitors to its website every month. This number continues to grow and grow as more and more customers learn about our products and mission.</p> <h3>How are you doing today and what does the future look like?</h3> <p>Today, Romperjack is doing great! So far, we have been growing by an average of 60% month to month in 2019 and things are looking great. </p> <p>Here are some notable analytics</p> <ul>\n<li><p>Monthly Visitors: &gt;40,000</p></li> <li><p>2.4% Conversion Rate</p></li> <li><p>15,000 Email Subscribers</p></li> <li><p>20,000 Instagram followers</p></li> <li><p>24% Return Customer Rate</p></li> </ul>\n<p>We have some really cool things planned for our future. Since we have now established a brand, we are excited to begin to offer other products other than just rompers. We just recently launched our first pair of mens shorts and have plans to launch mens overalls and nice button-up shirts. We also recently launched a womens overall brand called Romperjill that has already completely sold out.</p> <p>Our goal is to grow Romperjack into a recognizable global brand and to have its success continue to be carried on either by us (the founding team) or by a possible buyer in the future.</p> <h3>Through starting the business, have you learned anything particularly helpful or advantageous?</h3> <p>Over the last 2 years, we have learned so much from Romperjack - our first ecommerce business. </p> <p>The main takeaways from starting this company are that we learned how to define a proper audience, learned a ton about online marketing, how to deal with inventory, how to successfully source products from overseas, and most of all, the importance of establishing a brand rather than just a product.</p> <p>We have also had many hardships over the past 2 years. The 2 in particular: dealing with inventory and available cash to increase growth.</p> <p>Inventory has killed more companies than the plague. If you are familiar with the book <em>The 80/20 Rule,</em> you could clearly apply this rule to your different SKUs and see that there is a very true correlation. </p> <p>We quickly saw this with Romperjack when we made the huge mistake of launching way to many styles and assuming they would sell. Now we see that literally 80% of our sales come from only 20% of our products. So to combat this, we order a very low amount of new designs until they are proven high sellers and order a very large amount of the popular designs.</p> <p>Lack of capital is also startup killer. To grow, you always need capital. We were actually growing faster than we could afford, which in turn, actually slowed our growth in a sense. We still have this problem to date. </p> <p>We are growing anywhere between 60-100% month to month but we can’t afford to order enough product at that rate either because some SKU’s are still unsold or because our funding capital has already been spent the previous month. To combat this we take high credit lines with terrible terms that require quick payback. Unfortunately, this eats into our profit but it avoids us selling equity early on.</p> <h3>What platform/tools do you use for your business?</h3> <ul>\n<li><p><a href=\"https://www.sketch.com/\">Sketch</a>, Photoshop (and other Adobe Suite apps) for design</p></li> <li><p>Slack for communication</p></li> <li><p>Dropbox &amp; Google Drive for file sharing</p></li> <li><p><a href=\"https://www.taxjar.com/\">Taxjar</a> for sales tax</p></li> <li><p>Klaviyo for email marketing</p></li> <li><p>Facebook for customer chats</p></li> <li><p><a href=\"https://www.yotpo.com/\">Yotpo</a> for customer reviews</p></li> <li><p>Shopify For e-commerce</p></li> </ul>\n<p>Marketing Platforms:</p> <ul>\n<li><p>Instagram/Facebook</p></li> <li><p>Adroll - retargeting</p></li> <li><p>Google Ad words</p></li> <li><p>Reddit Ads</p></li> </ul>\n<h3>What have been the most influential books, podcasts, or other resources?</h3> <p>Books</p> <ul>\n<li><p><a href=\"https://www.the1thing.com/\">The One Thing</a></p></li> <li><p>How to win friends and influence people</p></li> <li><p>The 80/20 Principle</p></li> </ul>\n<p>Favorite Podcast</p> <ul>\n<li>How I Built This with Guy Raz</li> </ul>\n<h3>Advice for other entrepreneurs who want to get started or are just starting out?</h3> <p>Always start small and lean. Prove the idea/concept - never just dive straight in. One of the best methods is to follow the Lean Startup method by Steve Blake. Also if you fail do it fast, most of the time you can see a business crashing before it sinks. “You wouldn’t try to repair a sinking ship in rough waters”</p> <p>Last but not least always start or launch something you actually enjoy doing otherwise you will just get bored and the probability of it failing is much higher.</p> <p>Watch for trends and act fast.</p> <h3>Are you looking to hire for certain positions right now?</h3> <p>No not at the moment, but maybe in the near future. A fun fact: every hire to date, other than the founding team, has been a stay-at-home mom/dad. Usually new parents who were in the workforce and just recently had a child. We feel like hiring stay-at-home dads and moms is a bit of a way for us to give back and to help support new parents.</p> <h3>Where can we go to learn more?</h3> <ul>\n<li><a href=\"http://www.romperjack.com/\">Romperjack.com</a></li> </ul>\n<p>Email: <a href=\"mailto:hello@romperjack.com\">hello@romperjack.com</a></p> <p>If you have any questions or comments, drop a comment below!</p> <hr>\n<p>Liked this text interview? Check out the <a href=\"http://starterstory.com/stories/how-i-started-a-60k-month-business-selling-male-rompers\">full interview with photos, tools, books, and other data</a>.</p> <p>For more interviews, check out <a href=\"https://www.reddit.com/r/starter_story\">r/starter_story</a> - I post new stories there daily.</p> <p><em>Interested in sharing your own story? Send me a PM</em></p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/youngrichntasteless\"> /u/youngrichntasteless </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2j10c/60kmo_selling_male_rompers/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2j10c/60kmo_selling_male_rompers/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Hey - Pat from <a href=\"https://www.starterstory.com/\">StarterStory.com</a> here with another interview.</p> <p>Today's interview is with Justin Clark of <a href=\"https://www.romperjack.com/\">RomperJack</a>, a brand that sells men's rompers and jumpsuits.</p> <p><strong>Some stats:</strong></p> <ul>\n<li>Product: Men's rompers and jumpsuits.</li> <li>Revenue/mo: $60,000</li> <li>Started: July 2017</li> <li>Location: Los Angeles</li> <li>Founders: 3</li> <li>Employees: 1</li> </ul>\n<h3>Hello! Who are you and what business did you start?</h3> <p>Hello, my name is Justin Clark, I’m 31 and I am the founder of <a href=\"https://romperjack.com/\">RomperJack</a>. RomperJack is a men’s apparel company that specifically sells men's rompers and jumpsuits. Our rompers are made from premium materials and designed to be perfectly fitted.</p> <p>RomperJack is a premium men’s brand that is predominately preferred by the LGBTQ community. Our customers tend to be bold, confident and unique. Our customers enjoy our floral patterns, tight fit, and whacky styling.</p> <p>Men's rompers are very unique and have not even been around for 2 years yet.</p> <p>For those who are unfamiliar with a mens romper; it’s a button up shirt sewn into shorts and a jumpsuit is a button up shirt sewn into pants, like a fashionable onesie. Check out the pictures below….</p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/708/original/open-uri20190526-4-m7fhpd?1558887068\">image</a></p> <p><em>Romper/Jumpsuit….</em></p> <h3>What's your backstory and how did you come up with the idea?</h3> <p>Actually, it’s kind of a cool backstory... </p> <p>In late 2015, I was just about to go to Medical School and shortly before, I came up with an app idea called <a href=\"http://www.whiztutorapp.com/\">Whiz Tutor</a>. Whiz Tutor is similar to Uber however, is designed to help parents and students find local, on-demand tutors in their area. </p> <p>Long story short, I raised capital, launched the platform, went through an accelerator program, raised more capital, and began to scale. I ended up choosing to remain in the entrepreneur world and haven’t looked back. This early startup ultimately gave me the skills and provided me with the team that would later open the door to RomperJack. Whiz Tutor to this date is still our main focus and is continuing to prosper and grow everyday.</p> <p>As Whiz Tutor was growing and becoming more and more popular, we never really thought about how slow it would be during the summertime as an Ed-tech startup. Well, let’s just say you can hear crickets in our office during summertime because Tutoring is not cool and hip especially when school is on break. Summer time is Whiz Tutor’s slow period so this gives us time to play around with other possible business opportunities.</p> <p>In May 2017 just after finals ended (Just after our busiest time for whiz tutor), I came across a Kickstarter campaign called <a href=\"https://www.kickstarter.com/projects/106904571/the-romphimtm-your-new-favorite-summer-outfit\">Romphim</a>; it was a couple of guys trying to launch the men's romper. They essentially wanted to raise $10,000 to get their project going, but by day 3 they already raised $330,000! I was blown away!! The first thing that popped in my head was product-market fit. They had this instant explosive traction and they didn’t have a single competitor. </p> <p>So I gave them a competitor, MEEEE 😎. I remember that day calling a couple of friends and quickly asking them for some funding that would be used to help design the rompers and buy inventory. After about a minute of me pitching them, they all happily agreed. Also, My other Whiz Tutor Co-founders all agreed to help as well. </p> <p>That was the day the idea was born. </p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/709/original/open-uri20190526-4-ds9rml?1558887068\">image</a></p> <h3>Take us through the process of designing, prototyping, and manufacturing your first product.</h3> <p>When we first saw the romper on Kickstarter, all we had to work with was a picture since no one was actually selling mens rompers at the time. </p> <p>So we took that picture, threw it into Photoshop, changed the color and gave the romper a more tapered and fitted look. We changed the fit and look of the romper because we were targeting the LGBTQ audience. This specific customers tends to like clothing more fitted. Once we were happy with the look that's when I reached out to different manufacturers on Alibaba.</p> <p>Before Romperjack, I did have some experience sourcing products on Alibaba. I’ve sourced many samples for other side projects that never really got going but that experience gave me a pretty good upper-hand. </p> <p>Usually, when you source products, you reach out to multiple manufacturers for samples, but since no one has ever made this product, we had to do this differently. I vividly remember this clothing manufacturer that I stumbled upon who was making women's’ rompers oversees. </p> <p>I decided to email them a picture of the romper and asked if they could make it. A man named Baloo (yes like The Jungle Book) responded to the email and started asking me all sorts of fashion/garment manufacturing questions. I had no idea what he was talking about. I knew absolutely nothing about fashion so I was completely lost. </p> <p>So, I just told him “Baloo I don’t know a single thing about fashion but I need to get a sample made, can you take this picture and pretend you were going to make a men’s romper sample for a 180lb, 6-foot man.” </p> <p>He emailed back and said “My friend, no problem. I make for you!” Two weeks later I had a sample. 😂</p> <p>The first sample we got was really, really bad. The material was really thin, the fit was way off and it felt cheaply made. However, we at least had something to work with. We measured the sample and then went shopping for better materials.</p> <p><a href=\"https://s3.amazonaws.com/www.starterstory.com/story_images/images/000/001/710/original/open-uri20190526-4-7sw691?1558887069\">image</a></p> <p><em>The picture above is of my brother wearing the first sample. This was actually the first picture taken of the product.</em></p> <p>I sent Baloo the material we were looking for and the new measurements. Within two weeks, we got the new samples and they were perfect! Baloo and I discussed MOQ (Minimum order quantity) pricing and once I was satisfied, I made a bulk order for 1 style with 4 different colors.</p> <p>The first order we purchased was for 1200 pieces 4 different styles.</p> <h3>Describe the process of launching the business.</h3> <p>At the time, none of us had any experience with fashion nor an inventory-related business, so we were like a chicken blindfolded running around when we launched. </p> <p>The first issue we had when creating our website was that we had no available product to take pictures of so we had to use our photoshop mock-ups to create the original site. The second issue was that we had no clear understanding of who our market was. No one had ever tried to sell a male romper before, so we had no idea who to even market to. </p> <p>Even though we had some things against us we did know how to create a business, market/advertise and how to create a well-designed website. For the website, we decided to use Shopify to power our e-commerce store and host our site. Shopify definitely has the best platform for merchants. To file our business LLC and to create a DBA, we used <a href=\"https://www.legalzoom.com/country/us\">LEGALZOOM</a>.</p> <p>We also filed for a trademark to protect the RomperJack name, to do this we used <a href=\"https://www.trademarkia.com/\">Trademarkia</a>. To source the product and find credible manufacturers we used Alibaba.</p> <p>Once we finally finished building the site, we needed to run a live test to make sure everything was functioning correctly.. (keep in mind we had no product at this time, I believe the product was not supposed to arrive for about 35 more days). I published the website to test everything and 30 seconds after doing so, someone in San Francisco somehow found our brand new romper site and purchased a romper. NO JOKE!!! 30 seconds after launch, someone bought!!! We all freaked out, we didn’t even have anything to send him, lol. Long story short we had to email the customer to let him know what had happened and we promised him a free romper once we got our stock.</p> <p>The customer that bought the first romper gave us the idea to sell on pre-order because we knew that customers would still purchase pre-orders if no one else was selling rompers yet. So we officially launched the store on July 10, 2017 and on the first day, I remember we did about $1200 in sales. We were so stoked and have only continued to grow since then.</p> <h3>Since launch, what has worked to attract and retain customers?</h3> <p>Before Romperjack came to life, we were already running 2 online companies making us already extremely familiar with different online marketing tactics. However, we weren’t sure which ones would necessarily work better - which is where testing came in to play. </p> <p>When we first launched Romperjack, we had a huge advantage right off the bat which was having very very strong SEO, like page 1 spot #2 for our keywords. This was simply due to the fact that there were only 2 companies in the world at the time selling mens rompers - Us (Romperjack) and Romphim. Since this day, we have remained in the #2 spot.</p> <p>To build our initial traffic and to find an audience, we tested and utilized a ton of different marketing platforms… Facebook/Instagram, Snapchat, Pinterest, Ad roll (retargeting), Google Ad Words, Bing Ad Words, Reddit Ads, Outbrain, Influencer Marketing etc… Now, not all these platforms worked. In fact, some of them failed miserably.</p> <p>Over the past 2 years, we have simplified our marketing down to 4 keys things: I will break them down:</p> <p><strong>Facebook and Instagram Ads</strong></p> <p>We use this platform to find new customers and to retarget current interested customers. Facebook ROAS is about 4.2X. </p> <p>In the beginning we casted a very wide net to find our target audience and as we got more and more sales we narrowed that audience down. Now we run lookalike campaigns based off our customer list. </p> <p>We also have a sales funnel setup to capture a customer at multiple stages. We run a ton of retargeting campaigns at different stages to finalize the sale.</p> <p><strong>Google AdWords</strong></p> <p>We use this platform for the mid-level funnel. People who find us through Google Ad Words by searching our key words means that they are seriously thinking about buying. We buy keywords like mens romper or male romper so when one puts that into google we pop up.</p> <p><strong>AdRoll</strong></p> <p>This does retargeting that is seen on 1000’s of websites. Retargeting is a way to show ads to customers that visited your site but did not purchase. It’s kind of like subliminal marketing, they see the ad and it reminds them, then later on they come to back to purchase. We have about a 12X ROAS with retargeting. This is super simple to setup, Adroll will even make the ad for you.</p> <p>The last thing we use is email marketing. We build email lists of interested customers by offering them something when they subscribe. These lists build over time and with the right campaign we can get these customers to convert quite well.</p> <p>All in all, Romperjack has about 45k visitors to its website every month. This number continues to grow and grow as more and more customers learn about our products and mission.</p> <h3>How are you doing today and what does the future look like?</h3> <p>Today, Romperjack is doing great! So far, we have been growing by an average of 60% month to month in 2019 and things are looking great. </p> <p>Here are some notable analytics</p> <ul>\n<li><p>Monthly Visitors: &gt;40,000</p></li> <li><p>2.4% Conversion Rate</p></li> <li><p>15,000 Email Subscribers</p></li> <li><p>20,000 Instagram followers</p></li> <li><p>24% Return Customer Rate</p></li> </ul>\n<p>We have some really cool things planned for our future. Since we have now established a brand, we are excited to begin to offer other products other than just rompers. We just recently launched our first pair of mens shorts and have plans to launch mens overalls and nice button-up shirts. We also recently launched a womens overall brand called Romperjill that has already completely sold out.</p> <p>Our goal is to grow Romperjack into a recognizable global brand and to have its success continue to be carried on either by us (the founding team) or by a possible buyer in the future.</p> <h3>Through starting the business, have you learned anything particularly helpful or advantageous?</h3> <p>Over the last 2 years, we have learned so much from Romperjack - our first ecommerce business. </p> <p>The main takeaways from starting this company are that we learned how to define a proper audience, learned a ton about online marketing, how to deal with inventory, how to successfully source products from overseas, and most of all, the importance of establishing a brand rather than just a product.</p> <p>We have also had many hardships over the past 2 years. The 2 in particular: dealing with inventory and available cash to increase growth.</p> <p>Inventory has killed more companies than the plague. If you are familiar with the book <em>The 80/20 Rule,</em> you could clearly apply this rule to your different SKUs and see that there is a very true correlation. </p> <p>We quickly saw this with Romperjack when we made the huge mistake of launching way to many styles and assuming they would sell. Now we see that literally 80% of our sales come from only 20% of our products. So to combat this, we order a very low amount of new designs until they are proven high sellers and order a very large amount of the popular designs.</p> <p>Lack of capital is also startup killer. To grow, you always need capital. We were actually growing faster than we could afford, which in turn, actually slowed our growth in a sense. We still have this problem to date. </p> <p>We are growing anywhere between 60-100% month to month but we can’t afford to order enough product at that rate either because some SKU’s are still unsold or because our funding capital has already been spent the previous month. To combat this we take high credit lines with terrible terms that require quick payback. Unfortunately, this eats into our profit but it avoids us selling equity early on.</p> <h3>What platform/tools do you use for your business?</h3> <ul>\n<li><p><a href=\"https://www.sketch.com/\">Sketch</a>, Photoshop (and other Adobe Suite apps) for design</p></li> <li><p>Slack for communication</p></li> <li><p>Dropbox &amp; Google Drive for file sharing</p></li> <li><p><a href=\"https://www.taxjar.com/\">Taxjar</a> for sales tax</p></li> <li><p>Klaviyo for email marketing</p></li> <li><p>Facebook for customer chats</p></li> <li><p><a href=\"https://www.yotpo.com/\">Yotpo</a> for customer reviews</p></li> <li><p>Shopify For e-commerce</p></li> </ul>\n<p>Marketing Platforms:</p> <ul>\n<li><p>Instagram/Facebook</p></li> <li><p>Adroll - retargeting</p></li> <li><p>Google Ad words</p></li> <li><p>Reddit Ads</p></li> </ul>\n<h3>What have been the most influential books, podcasts, or other resources?</h3> <p>Books</p> <ul>\n<li><p><a href=\"https://www.the1thing.com/\">The One Thing</a></p></li> <li><p>How to win friends and influence people</p></li> <li><p>The 80/20 Principle</p></li> </ul>\n<p>Favorite Podcast</p> <ul>\n<li>How I Built This with Guy Raz</li> </ul>\n<h3>Advice for other entrepreneurs who want to get started or are just starting out?</h3> <p>Always start small and lean. Prove the idea/concept - never just dive straight in. One of the best methods is to follow the Lean Startup method by Steve Blake. Also if you fail do it fast, most of the time you can see a business crashing before it sinks. “You wouldn’t try to repair a sinking ship in rough waters”</p> <p>Last but not least always start or launch something you actually enjoy doing otherwise you will just get bored and the probability of it failing is much higher.</p> <p>Watch for trends and act fast.</p> <h3>Are you looking to hire for certain positions right now?</h3> <p>No not at the moment, but maybe in the near future. A fun fact: every hire to date, other than the founding team, has been a stay-at-home mom/dad. Usually new parents who were in the workforce and just recently had a child. We feel like hiring stay-at-home dads and moms is a bit of a way for us to give back and to help support new parents.</p> <h3>Where can we go to learn more?</h3> <ul>\n<li><a href=\"http://www.romperjack.com/\">Romperjack.com</a></li> </ul>\n<p>Email: <a href=\"mailto:hello@romperjack.com\">hello@romperjack.com</a></p> <p>If you have any questions or comments, drop a comment below!</p> <hr>\n<p>Liked this text interview? Check out the <a href=\"http://starterstory.com/stories/how-i-started-a-60k-month-business-selling-male-rompers\">full interview with photos, tools, books, and other data</a>.</p> <p>For more interviews, check out <a href=\"https://www.reddit.com/r/starter_story\">r/starter_story</a> - I post new stories there daily.</p> <p><em>Interested in sharing your own story? Send me a PM</em></p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/youngrichntasteless\"> /u/youngrichntasteless </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2j10c/60kmo_selling_male_rompers/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2j10c/60kmo_selling_male_rompers/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"How to make entrepreneurial friends?","pubDate":"2019-06-19 09:43:16","link":"https://www.reddit.com/r/Entrepreneur/comments/c2f0uf/how_to_make_entrepreneurial_friends/","guid":"t3_c2f0uf","author":"/u/extraquestial","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I think it's been well established that events titled \"networking event\" aren't super helpful. I don't even want to mooch, I would be cool to get a piece of advice or get some anecdotes but for the most part I just want entrepreneurial friends for the sense of camaraderie, so can feel like we're going through something together, and talk about our experiences. </p> <p>The first move is obviously to get my ass out of my small town and move to a big city which is happening soon. After that, where do entrepreneurs drink and hang out?</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/extraquestial\"> /u/extraquestial </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2f0uf/how_to_make_entrepreneurial_friends/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2f0uf/how_to_make_entrepreneurial_friends/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I think it's been well established that events titled \"networking event\" aren't super helpful. I don't even want to mooch, I would be cool to get a piece of advice or get some anecdotes but for the most part I just want entrepreneurial friends for the sense of camaraderie, so can feel like we're going through something together, and talk about our experiences. </p> <p>The first move is obviously to get my ass out of my small town and move to a big city which is happening soon. After that, where do entrepreneurs drink and hang out?</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/extraquestial\"> /u/extraquestial </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2f0uf/how_to_make_entrepreneurial_friends/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2f0uf/how_to_make_entrepreneurial_friends/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"My company is successful now - but I keep wondering how far I want to take it. Who’s been here before? Lifestyle business vs large company?","pubDate":"2019-06-19 08:51:06","link":"https://www.reddit.com/r/Entrepreneur/comments/c2emro/my_company_is_successful_now_but_i_keep_wondering/","guid":"t3_c2emro","author":"/u/ajcassata","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Hi everyone I’d love some perspective from your unique experience.</p> <p>So I am 24 years old. I got into online marketing about 3 years ago. I quit a good corporate job and started a company with a girl I met from North Carolina .</p> <p>Now I run a digital advertising agency. It’s quite successful and growing fast. </p> <p>I keep debating in my head whether I want to make this a 4-8 employee business, or turn it into a big deal with like 50 employees and an office. </p> <p>I know what to do, I have the potential to really grow it. I have a great team, I know my skills, I know my niche, and I have a great business model. </p> <p>However, life’s pretty good right now. </p> <p>Iv been making consistent more than 6k a month, I’m living in Vietnam so that’s almost like 28k a month USD due to currensy difference. </p> <p>So, I plan to keep growing and there’s more I want to accomplish. </p> <p>But I wonder if I went full force, maybe acquired more partners, and turned this into a huge agency if I would regret it.</p> <p>I think I can run a big and healthy busienss with a small team if we focus on profitable deals. I’m trying to learn from others who have done that</p> <p>The question is, what is your experience with a lifestyle biz verse really big company? Small vs big? I think it would be awesome to run a massive agency and make a mark but I’m just not sure about what level of responsibility I want to take.</p> <p>I’m also 24. Lol</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/ajcassata\"> /u/ajcassata </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2emro/my_company_is_successful_now_but_i_keep_wondering/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2emro/my_company_is_successful_now_but_i_keep_wondering/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>Hi everyone I’d love some perspective from your unique experience.</p> <p>So I am 24 years old. I got into online marketing about 3 years ago. I quit a good corporate job and started a company with a girl I met from North Carolina .</p> <p>Now I run a digital advertising agency. It’s quite successful and growing fast. </p> <p>I keep debating in my head whether I want to make this a 4-8 employee business, or turn it into a big deal with like 50 employees and an office. </p> <p>I know what to do, I have the potential to really grow it. I have a great team, I know my skills, I know my niche, and I have a great business model. </p> <p>However, life’s pretty good right now. </p> <p>Iv been making consistent more than 6k a month, I’m living in Vietnam so that’s almost like 28k a month USD due to currensy difference. </p> <p>So, I plan to keep growing and there’s more I want to accomplish. </p> <p>But I wonder if I went full force, maybe acquired more partners, and turned this into a huge agency if I would regret it.</p> <p>I think I can run a big and healthy busienss with a small team if we focus on profitable deals. I’m trying to learn from others who have done that</p> <p>The question is, what is your experience with a lifestyle biz verse really big company? Small vs big? I think it would be awesome to run a massive agency and make a mark but I’m just not sure about what level of responsibility I want to take.</p> <p>I’m also 24. Lol</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/ajcassata\"> /u/ajcassata </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2emro/my_company_is_successful_now_but_i_keep_wondering/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2emro/my_company_is_successful_now_but_i_keep_wondering/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"How did you decide which ideas to pursue?","pubDate":"2019-06-19 14:02:15","link":"https://www.reddit.com/r/Entrepreneur/comments/c2hgmb/how_did_you_decide_which_ideas_to_pursue/","guid":"t3_c2hgmb","author":"/u/noahkirkwood","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I've been running a small video production company for years now, and really lost my passion for videography. I'm finding it really hard to scale and basically want to get into something that can have a bigger impact on a broader audience. I have many ideas I'd like to trial and send out into the world, from new product designs to online platforms, but I'm basically frozen. I guess you could call it analysis paralysis. I have no idea where to invest my time, energy, and money because I'm spreading myself too thin. Nothing's getting done.</p> <p>Do I focus on one idea at a time? Perhaps a month at a time? Push them all at once and see which one takes off? Push one until it takes off or breaks and then move on to the next?</p> <p>I feel like I need someone more experienced to tell me how to deal with this situation. My videography business came about because I had those skills and thought I could make some money. But now I have a broader picture of the world there are so many things I want to try, and I don't know how to channel my energy.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/noahkirkwood\"> /u/noahkirkwood </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hgmb/how_did_you_decide_which_ideas_to_pursue/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hgmb/how_did_you_decide_which_ideas_to_pursue/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I've been running a small video production company for years now, and really lost my passion for videography. I'm finding it really hard to scale and basically want to get into something that can have a bigger impact on a broader audience. I have many ideas I'd like to trial and send out into the world, from new product designs to online platforms, but I'm basically frozen. I guess you could call it analysis paralysis. I have no idea where to invest my time, energy, and money because I'm spreading myself too thin. Nothing's getting done.</p> <p>Do I focus on one idea at a time? Perhaps a month at a time? Push them all at once and see which one takes off? Push one until it takes off or breaks and then move on to the next?</p> <p>I feel like I need someone more experienced to tell me how to deal with this situation. My videography business came about because I had those skills and thought I could make some money. But now I have a broader picture of the world there are so many things I want to try, and I don't know how to channel my energy.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/noahkirkwood\"> /u/noahkirkwood </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hgmb/how_did_you_decide_which_ideas_to_pursue/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hgmb/how_did_you_decide_which_ideas_to_pursue/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"Marketing ideas","pubDate":"2019-06-19 14:00:21","link":"https://www.reddit.com/r/Entrepreneur/comments/c2hfvx/marketing_ideas/","guid":"t3_c2hfvx","author":"/u/SlowDownBrother","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I have great products, packaging, branding &amp; website. The products are shampoos, soaps, body oils, etc. I make everything in small batches. My broad target market is everyone, but mainly adult women &amp; men. I sell both online, direct to the customer, also to brick and mortar business's.</p> <p>My selling point is that everything is handmade in small batches using natural ingredients, with products themed after local attractions/places. An \"artisanal\" styled brand.</p> <p>The profit margins on my products are huge, so I dont need to make a lot of sales to make a good profit.</p> <p>I need your insights &amp; ideas to increase my sales numbers and sales channels</p> <ol>\n<li><p>What are some local business's I could sell my products to &amp; how do I go about approaching them?</p></li> <li><p>What thoughts do you have about marketing these products?</p></li> <li><p>There are a lot of tourists in my area, is there a way I could take advantage of that to make more sales?</p></li> </ol>\n</div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/SlowDownBrother\"> /u/SlowDownBrother </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hfvx/marketing_ideas/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hfvx/marketing_ideas/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I have great products, packaging, branding &amp; website. The products are shampoos, soaps, body oils, etc. I make everything in small batches. My broad target market is everyone, but mainly adult women &amp; men. I sell both online, direct to the customer, also to brick and mortar business's.</p> <p>My selling point is that everything is handmade in small batches using natural ingredients, with products themed after local attractions/places. An \"artisanal\" styled brand.</p> <p>The profit margins on my products are huge, so I dont need to make a lot of sales to make a good profit.</p> <p>I need your insights &amp; ideas to increase my sales numbers and sales channels</p> <ol>\n<li><p>What are some local business's I could sell my products to &amp; how do I go about approaching them?</p></li> <li><p>What thoughts do you have about marketing these products?</p></li> <li><p>There are a lot of tourists in my area, is there a way I could take advantage of that to make more sales?</p></li> </ol>\n</div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/SlowDownBrother\"> /u/SlowDownBrother </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hfvx/marketing_ideas/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2hfvx/marketing_ideas/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"Website advice - be careful with mandatory fields","pubDate":"2019-06-18 20:53:49","link":"https://www.reddit.com/r/Entrepreneur/comments/c27q7u/website_advice_be_careful_with_mandatory_fields/","guid":"t3_c27q7u","author":"/u/DrunkenGolfer","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>As someone who does not live in the US, it frustrates me to no end to go through the hassle of filling out a contact form only to have my \"Zip Code\" rejected because of non-numeric characters or the information I have entered rejected because I didn't pick a state. I don't have a zip code; I have a four-character postal code. I don't have a state. I don't have a province. I get particularly incensed when a form allows me to specify my country but then insists I pick a US state. I go postal (pun intended) when picking a random state (because I am forced to enter something) results in an error message \"State doesn't match Zip code\".</p> <p>I just tried to purchase an eBook online and couldn;t. No matter how many different combinations of fudged addresses I attempted, I just could not unlock the magic combination that would let me give my money to the seller of goods.</p> <p>Remember there is a much bigger market out there and your web forms could be driving international customers away.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/DrunkenGolfer\"> /u/DrunkenGolfer </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c27q7u/website_advice_be_careful_with_mandatory_fields/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c27q7u/website_advice_be_careful_with_mandatory_fields/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>As someone who does not live in the US, it frustrates me to no end to go through the hassle of filling out a contact form only to have my \"Zip Code\" rejected because of non-numeric characters or the information I have entered rejected because I didn't pick a state. I don't have a zip code; I have a four-character postal code. I don't have a state. I don't have a province. I get particularly incensed when a form allows me to specify my country but then insists I pick a US state. I go postal (pun intended) when picking a random state (because I am forced to enter something) results in an error message \"State doesn't match Zip code\".</p> <p>I just tried to purchase an eBook online and couldn;t. No matter how many different combinations of fudged addresses I attempted, I just could not unlock the magic combination that would let me give my money to the seller of goods.</p> <p>Remember there is a much bigger market out there and your web forms could be driving international customers away.</p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/DrunkenGolfer\"> /u/DrunkenGolfer </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c27q7u/website_advice_be_careful_with_mandatory_fields/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c27q7u/website_advice_be_careful_with_mandatory_fields/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]},{"title":"Validating a product","pubDate":"2019-06-18 20:05:17","link":"https://www.reddit.com/r/Entrepreneur/comments/c2741f/validating_a_product/","guid":"t3_c2741f","author":"/u/punknight","thumbnail":"","description":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I have learned the hard way, it is a good idea to create some projections about the value of your product before you put too much work into it. This article is about some ways to go about doing that.</p> <p>Startup School and the $100 Startup</p> <p>Sometime in 2018, I became infatuated with the idea of an app called motivation-therapy. After building the app framework and finding beta testers, I was feeling good about my product and I started looking at “accelerators.” For those of you who aren’t familiar, here is a quick definition from Wikipedia: “Startup Accelerators, also known as seed accelerators, are fixed-term, cohort-based programs that include seed investment, connections, mentorship, educational components, and culminate in a public pitch event or demo day to accelerate growth.” The gold standard for accelerators in the San Francisco Bay Area is Y-combinator. Because of the number of successful startups Y-combinator has produced, being able to say your company is a Y-combinator graduate lends more validation to your business than actually having revenue. I wanted to apply to Y-combinator, but they only had two “batches” a year, and I was in-between batches. However, after doing some research, I found out that they had a program called “Startup School.” Startup School (SuS) is a free program to help funnel companies into the more prestigious Y-Combinator batches. Through a fluke, they let me in to Startup School, and I got to learn all about how VCs look at the world.</p> <p>One message that SuS taught early-on, and then repeated almost every lesson, is that a company takes time to find “Product-Market Fit”. Product-Market fit is the idea that when you start a company, you are trying to solve a problem for a particular group of people (i.e. the “market”) and you solve that problem by selling them a good or service (i.e. the “product”). During the life of a young company, the market might change and the product might change, but ultimately the problem that is being solved does not change. Until I could earn enough revenue that the company could cover its expenses, the product or the market would have to change.</p> <p>A key way to determine whether you are moving in the right direction is launching something small, and using a user analytics platform to statistics about your users. Here is a list of a few:</p> <p>*Amplitude *Google Analytics *Mixpanel *Jetpack (for WordPress)</p> <p>After SuS, I continued to read books on entrepreneurship, and one of the best was called The $100 Startup by Chris Guillebeau. It covered the same main idea as product-market fit, but also noted that you need to be able to connect the two with an offer.</p> <p>Ok, that was a long prologue to get to the point. With motivation-therapy, I had an idea in my head, and I had some ideas of the market, but I never really had an offer to connect the two. Money wouldn’t just fall from the sky once I had users. I released a beta version of the product and never asked for money, so the product eventually died. </p> <p>Going through that, I get that it can be very helpful to validate an idea before pursuing it fully. Validating can be useful because you have to find a target market before you can even build a product. In the beginning, this meant I used Buzzsumo to see which social networks were most amenable to my product. Then I started testing different subreddits on Reddit to gauge interest in my product. Once I got an idea of what people were interested in, I realized that there were a lot of todo list apps out there. I needed to find a way to validate my product over the many others.</p> <p>Traditional ways to validate a project include handing out surveys and talking to potential customers. More contemporary ways comprise: </p> <p>creating a video of the app and posting it on Indigogo or Kickstarter for financial support before creating the product, creating a click-through mockup of the app, and having real people fake the backend, until it’s finished, Email people the offer or a presale offer, and if enough customers accept the offer, say that version 2 is coming and they just need to wait a month (while you start and finish the product) There have been great stories of success with both the traditional and contemporary ways. Some of the more contemporary ways have a risk of angering your target customers if you can’t deliver on a promised product, but by putting that risk on the customer it protects the entrepreneur from building something that no one wants.</p> <p>TLDR: You should validate your product</p> <p>If you want to see this article with pictures, <a href=\"https://www.clearcutip.com/2019/06/18/validating-a-product/\">here is a link to the blog post</a></p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/punknight\"> /u/punknight </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2741f/validating_a_product/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2741f/validating_a_product/\">[comments]</a></span>\n","content":"\n<!-- SC_OFF --><div class=\"md\">\n<p>I have learned the hard way, it is a good idea to create some projections about the value of your product before you put too much work into it. This article is about some ways to go about doing that.</p> <p>Startup School and the $100 Startup</p> <p>Sometime in 2018, I became infatuated with the idea of an app called motivation-therapy. After building the app framework and finding beta testers, I was feeling good about my product and I started looking at “accelerators.” For those of you who aren’t familiar, here is a quick definition from Wikipedia: “Startup Accelerators, also known as seed accelerators, are fixed-term, cohort-based programs that include seed investment, connections, mentorship, educational components, and culminate in a public pitch event or demo day to accelerate growth.” The gold standard for accelerators in the San Francisco Bay Area is Y-combinator. Because of the number of successful startups Y-combinator has produced, being able to say your company is a Y-combinator graduate lends more validation to your business than actually having revenue. I wanted to apply to Y-combinator, but they only had two “batches” a year, and I was in-between batches. However, after doing some research, I found out that they had a program called “Startup School.” Startup School (SuS) is a free program to help funnel companies into the more prestigious Y-Combinator batches. Through a fluke, they let me in to Startup School, and I got to learn all about how VCs look at the world.</p> <p>One message that SuS taught early-on, and then repeated almost every lesson, is that a company takes time to find “Product-Market Fit”. Product-Market fit is the idea that when you start a company, you are trying to solve a problem for a particular group of people (i.e. the “market”) and you solve that problem by selling them a good or service (i.e. the “product”). During the life of a young company, the market might change and the product might change, but ultimately the problem that is being solved does not change. Until I could earn enough revenue that the company could cover its expenses, the product or the market would have to change.</p> <p>A key way to determine whether you are moving in the right direction is launching something small, and using a user analytics platform to statistics about your users. Here is a list of a few:</p> <p>*Amplitude *Google Analytics *Mixpanel *Jetpack (for WordPress)</p> <p>After SuS, I continued to read books on entrepreneurship, and one of the best was called The $100 Startup by Chris Guillebeau. It covered the same main idea as product-market fit, but also noted that you need to be able to connect the two with an offer.</p> <p>Ok, that was a long prologue to get to the point. With motivation-therapy, I had an idea in my head, and I had some ideas of the market, but I never really had an offer to connect the two. Money wouldn’t just fall from the sky once I had users. I released a beta version of the product and never asked for money, so the product eventually died. </p> <p>Going through that, I get that it can be very helpful to validate an idea before pursuing it fully. Validating can be useful because you have to find a target market before you can even build a product. In the beginning, this meant I used Buzzsumo to see which social networks were most amenable to my product. Then I started testing different subreddits on Reddit to gauge interest in my product. Once I got an idea of what people were interested in, I realized that there were a lot of todo list apps out there. I needed to find a way to validate my product over the many others.</p> <p>Traditional ways to validate a project include handing out surveys and talking to potential customers. More contemporary ways comprise: </p> <p>creating a video of the app and posting it on Indigogo or Kickstarter for financial support before creating the product, creating a click-through mockup of the app, and having real people fake the backend, until it’s finished, Email people the offer or a presale offer, and if enough customers accept the offer, say that version 2 is coming and they just need to wait a month (while you start and finish the product) There have been great stories of success with both the traditional and contemporary ways. Some of the more contemporary ways have a risk of angering your target customers if you can’t deliver on a promised product, but by putting that risk on the customer it protects the entrepreneur from building something that no one wants.</p> <p>TLDR: You should validate your product</p> <p>If you want to see this article with pictures, <a href=\"https://www.clearcutip.com/2019/06/18/validating-a-product/\">here is a link to the blog post</a></p> </div>\n<!-- SC_ON -->   submitted by   <a href=\"https://www.reddit.com/user/punknight\"> /u/punknight </a> <br><span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2741f/validating_a_product/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Entrepreneur/comments/c2741f/validating_a_product/\">[comments]</a></span>\n","enclosure":{},"categories":["Entrepreneur"]}]}